import React, { FC } from "react";

interface Posttype {
  1: string;
  2: string;
  3: string;
  4: any;
  5: any;
  6: string;
}

const Posts: Posttype[] = [
  {
    1: "사진링크1",
    2: "링크1",
    3: "카테고리1",
    4: "가격1",
    5: "글 작성시간1",
    6: "작성자1",
  },
  {
    1: "사진링크2",
    2: "링크2",
    3: "카테고리2",
    4: "가격2",
    5: "글 작성시간2",
    6: "작성자2",
  },
  {
    1: "사진링크3",
    2: "링크3",
    3: "카테고리3",
    4: "가격3",
    5: "글 작성시간3",
    6: "작성자3",
  },
  {
    1: "사진링크4",
    2: "링크4",
    3: "카테고리4",
    4: "가격4",
    5: "글 작성시간4",
    6: "작성자4",
  },
  {
    1: "사진링크5",
    2: "링크5",
    3: "카테고리5",
    4: "가격5",
    5: "글 작성시간5",
    6: "작성자5",
  },
];

export { Posts };
export type { Posttype };
